ubirch/ubirch-kinetis-sdk/SDK_2.0_MKL82Z128xxx7/boards/twrkl82z72m/demo_apps/emvl1/emvl1.c
/*******************************************************************************
* Code
******************************************************************************/

/*! @brief IRQ handler for emvsim */
void EMVSIM1_IRQHandler()
{
    SMARTCARD_EMVSIM_IRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
#if defined(USING_PHY_TDA8035)
/*! @brief IRQ handler for card presence detection */
void PORTA_IRQHandler(void)
{
    /* Clear interrupt status flags */
    PORT_ClearPinsInterruptFlags(PORTA, 1U << 13U);
    SMARTCARD_PHY_TDA8035_IRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
#endif
/*! @brief INTMUX0 irq handler to call EMVSIM1 interrupt routine. */
void INTMUX0_0_IRQHandler(void)
{
    /* Look up the interrupt handler function entrance */
    uint32_t vector_number;
    uint32_t *vector_table = (uint32_t *)SCB->VTOR;
    vector_number = INTMUX0->CHANNEL[0].CHn_VEC >> 2U;

    /* Only execute the right ISR */
    if (vector_number <= (FSL_FEATURE_INTERRUPT_IRQ_MAX + 16U))
    {
        return;
    }

    /* Define function pointer point to interrupt handler function entrance */
    void (*active_vector_isr)(void) = (void (*)(void))(vector_table[vector_number]);

    /* Jump to the interrupt handler function */
    active_vector_isr();
}
/*!
 * @brief Time delay required by smartcard test and smartcard driver. Function
 * waits desired time with accuracy 1ms.
 */
void timeDelay(uint32_t miliseconds)
{
    miliseconds++;
    /* Wait desired time */
    while (miliseconds > 0)
    {
        if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk)
        {
            miliseconds--;
        }
    }
}

/*!
 * @brief Function initializes time delay for smartcard driver
 */
void installTimeDelay(smartcard_context_t *context)
{
    /* Disable SysTick timer */
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
    /* Initialize Reload value to 1ms */
    SysTick->LOAD = CLOCK_GetFreq(kCLOCK_CoreSysClk) / 1000;
    /* Set clock source to processor clock */
    SysTick->CTRL |= SysTick_CTRL_CLKSOURCE_Msk;
    /* Enable SysTick timer */
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
    /* Store time delay function to smartcard context */
    context->timeDelay = timeDelay;
}

/*!
 * @brief Function initializes time delay for smartcard driver
 */
void smartcard_interrupts_config(void)
{
    /* Set smartcard communication peripheral interrupt priority */
    NVIC_SetPriority(BOARD_SMARTCARD_MODULE_IRQ, 8u);
#if defined(BOARD_SMARTCARD_MODULE_ERRIRQ)
    NVIC_SetPriority(BOARD_SMARTCARD_MODULE_ERRIRQ, 6u);
#endif
/* Set smartcard presence detect gpio pin interrupt priority */
#if defined(USING_PHY_TDA8035)
    NVIC_SetPriority(BOARD_SMARTCARD_IRQ_PIN_IRQ, 6u);
#endif /* USING_TDA8035_INTERFACE */
       /* Set external PIT timer interrupt priority
        * (used for initial TS char detection time-out) */
#if !(defined(FSL_FEATURE_SOC_EMVSIM_COUNT) && (FSL_FEATURE_SOC_EMVSIM_COUNT))
#if !defined(BOARD_SMARTCARD_TS_TIMER_IRQ)
#error "Please specify external PIT timer interrupt !"
#else
    NVIC_SetPriority(BOARD_SMARTCARD_TS_TIMER_IRQ, 6u);
#endif
#endif
}

/*!
 * @brief This function initialize smartcard_user_config_t structure. Enables configuration
 * of most common settings of the UART peripheral, smartcard clock, smartcard interface configuration,
 * interface instance number, slot number, operating voltage ...
 */
void smartcard_init_user_config(smartcard_context_t *context)
{
    /* Initialize interface configuration structure to default values */
    SMARTCARD_PHY_GET_DEFAULT_CONFIG(&context->interfaceConfig);
    context->interfaceConfig.smartCardClock = BOARD_SMARTCARD_CLOCK_VALUE;
    context->interfaceConfig.vcc = kSMARTCARD_VoltageClassB3_3V;
    context->interfaceConfig.clockModule = BOARD_SMARTCARD_CLOCK_MODULE;
    context->interfaceConfig.clockModuleChannel = BOARD_SMARTCARD_CLOCK_MODULE_CHANNEL;
    context->interfaceConfig.clockModuleSourceClock = BOARD_SMARTCARD_CLOCK_MODULE_SOURCE_CLK;
    context->interfaceConfig.controlPort = BOARD_SMARTCARD_CONTROL_PORT;
    context->interfaceConfig.controlPin = BOARD_SMARTCARD_CONTROL_PIN;
#if defined(BOARD_SMARTCARD_IRQ_PORT)
    context->interfaceConfig.irqPort = BOARD_SMARTCARD_IRQ_PORT;
    context->interfaceConfig.irqPin = BOARD_SMARTCARD_IRQ_PIN;
#endif
    context->interfaceConfig.resetPort = BOARD_SMARTCARD_RST_PORT;
    context->interfaceConfig.resetPin = BOARD_SMARTCARD_RST_PIN;
#if defined(USING_PHY_TDA8035)
    context->interfaceConfig.vsel0Port = BOARD_SMARTCARD_VSEL0_PORT;
    context->interfaceConfig.vsel0Pin = BOARD_SMARTCARD_VSEL0_PIN;
    context->interfaceConfig.vsel1Port = BOARD_SMARTCARD_VSEL1_PORT;
    context->interfaceConfig.vsel1Pin = BOARD_SMARTCARD_VSEL1_PIN;
#endif
#if defined(BOARD_SMARTCARD_TS_TIMER_ID)
    context->interfaceConfig.tsTimerId = BOARD_SMARTCARD_TS_TIMER_ID;
#endif
}

/*!
 * @brief Callback function for the Smartcard interface/PHY IC ISR
 */
void smartcard_interface_callback_function(void *base, void *g_smartcardState)
{
    /* Smartcard insertion/removal event occur */
    /* Put your code here */
}

/*!
 * @brief This function waits for card insertion/detection
 */
void wait_for_card_presence(smartcard_context_t *context)
{
    smartcard_interface_control_t interfaceControl = kSMARTCARD_InterfaceReadStatus;

    /* Putting delay as few boards has de-bouncing cap in card slot presence detect pin */
    timeDelay(1000);
    /* clear present flag */
    context->cardParams.present = 0;
    /* Read card presence status */
    SMARTCARD_PHY_CONTROL(context, interfaceControl, 0);
    /* Check if a card is already inserted */
    if (!context->cardParams.present)
    {
        PRINTF("Please insert a smart card to test\r\n");
    }
    /* Wait until card is present */
    while (true)
    {
        /* Read card presence status */
        SMARTCARD_PHY_CONTROL(context, interfaceControl, 0);
        /* Return if card is present/inserted */
        if (context->cardParams.present)
        {
            break;
        }
    }
}

/*!
 * @brief Function search for appropriate card AID from hard-coded table.
 */
card_type_t scan_aid(smartcard_core_params_t *coreParams, smartcard_tal_cmd_t *cmd, smartcard_tal_resp_t *resp)
{
    smartcard_core_error_t status;
    uint32_t i;

    for (i = 0; i < AID_ENTRIES; i++)
    {
        txBuff[0] = 0x00u;
        txBuff[1] = 0xA4u;
        txBuff[2] = 0x04u;
        txBuff[3] = 0x00u;
        txBuff[4] = g_aidTable[i][1];

        memcpy(&txBuff[5u], (uint8_t *)g_aidTable[i][0u], g_aidTable[i][1u]);
        txBuff[5u + g_aidTable[i][1u]] = 0x00u;
        cmd->length = 5u + g_aidTable[i][1u] + 1u;

        status = smartcard_tal_send_cmd(coreParams, cmd, resp);
        if (status == kSCCoreSuccess)
        { /* Match found. */
            switch (i)
            {
                case 0u:
                    return kCardMastercard;
                case 1u:
                    return kCardVisa;
                case 2u:
                    return kCardVisaElectron;
                case 3u:
                    return kCardAmex;
                case 4u:
                    return kCardEuropay;
                case 5u:
                    return kCardUnionPayDebit;
                case 6u:
                    return kCardUnionPayCredit;
            }
        }
    }
    /* No match. */
    return kCardUnsupported;
}

/*!
 * @brief Function sends EMV commands (Get processing options or read of specific record) to ICC.
 */
smartcard_core_error_t send_command(smartcard_core_params_t *coreParams,
                                    uint8_t p1,
                                    uint8_t p2,
                                    smartcard_tal_cmd_t *cmd,
                                    smartcard_tal_resp_t *resp,
                                    card_type_t type)
{
    /* Sending Get processing information */
    if ((0u == p1) && (0u == p2))
    {
        if (type == kCardUnsupported)
        {
            return kSCCoreInvalidInputParameter;
        }
        /* Union Pay cards require to send PDOL from terminal as command data (additional informative tag),
         * according AID file selection response. */
        if ((type == kCardUnionPayDebit) || (type == kCardUnionPayCredit))
        {
            cmd->apdu[0u] = 0x80u; /* Command class */
            cmd->apdu[1u] = 0xA8u; /* INS byte */
            cmd->apdu[2u] = 0x00u; /* P1 */
            cmd->apdu[3u] = 0x00u; /* P2 */
            cmd->apdu[4u] = 0x0Bu; /* Lc = 0x0B */
            /* Lc data */
            cmd->apdu[5u] =
                0x83u; /* Tag indicating requested PDOL objects parsed from AID selection file command response. */
            cmd->apdu[6u] = 0x09u; /* Length of PDOL data. (Data is send without tags.) */
            /* Hard-coded PDOL objects without objects tags. */
            /* VLP Terminal Support Indicator */
            cmd->apdu[7u] = 0x00u;
            /* Amount, Authorised (Numeric) */
            cmd->apdu[8u] = 0x00u;
            cmd->apdu[9u] = 0x00u;
            cmd->apdu[10u] = 0x00u;
            cmd->apdu[11u] = 0x00u;
            cmd->apdu[12u] = 0x01u;
            cmd->apdu[13u] = 0x00u;
            /* Transaction Currency code */
            cmd->apdu[14u] = 0x01u; /* China CNY */
            cmd->apdu[15u] = 0x56u; /* China CNY */
            cmd->apdu[16u] = 0u;    /* Le = 0 */
            cmd->length = 17u;
        }
        else
        { /* Most of MASTER and VISA cards doesn't require sending terminal PDOL tags.
           * Get processing options is send without PDOL tags.*/
            cmd->apdu[0u] = 0x80u;
            cmd->apdu[1u] = 0xA8u;
            cmd->apdu[2u] = 0x00u;
            cmd->apdu[3u] = 0x00u;
            cmd->apdu[4u] = 0x02u;
            cmd->apdu[5u] = 0x83u;
            cmd->apdu[6u] = 0x00u;
            cmd->apdu[7u] = 0x00u;
            cmd->length = 8u;
        }
    }
    else
    {                               /* Read record command to get specific data. */
        cmd->apdu[0u] = 0x00u;      /* Command class */
        cmd->apdu[1u] = 0xB2u;      /* INS - read record */
        cmd->apdu[2u] = p1;         /* P1 */
        cmd->apdu[3u] = p2 | 0x04u; /* P2 */
        cmd->apdu[4u] = 0x00u;      /* Lc = 0 */
        cmd->length = 5u;
    }
    return smartcard_tal_send_cmd(coreParams, cmd, resp);
}

/*!
 * @briefExtract AFL list from GET_PROCESSING_OPTIONS response.
 */
int extract_afl_list(uint8_t list[MAX_AFL][4], uint8_t *src)
{
    uint32_t i;
    uint32_t size = 0u;

