ubirch/ubirch-kinetis-sdk/SDK_2.0_MKL82Z128xxx7/boards/twrkl82z72m/demo_apps/emvl1/emvl1.c
    return true;
}

/*!
 * @brief T=1 protocol test using EMV Level 1 APIs
 */
static bool smartcard_emvl1_t1_test(smartcard_core_params_t *coreParams)
{
    int length;
    int i;
    int increment = 1;
    smartcard_tal_cmd_t talCmd;
    smartcard_tal_resp_t talResp;

    PRINTF("==========================================\r\n");
    PRINTF("Protocol T=1 test started!\r\n");

    /******************* Setup for T=0 transfer *******************/
    smartcard_setup_t0(coreParams);
    /* send a PPS indicating T=1 protocol */
    txBuff[0u] = 0xFFu;
    txBuff[1u] = 0x01u;
    txBuff[2u] = 0x00u;

    for (i = 0u; i < 2u; i++)
    {
        txBuff[2u] ^= txBuff[i];
    }

    memset(rxBuff, 0, EMVL1_MAX_TRANSFER_SIZE);
    smartcard_send_pps(coreParams, txBuff, rxBuff, 3);

    /* T=1 protocol test */
    length = 16u; /* payload */
    /* APDU */
    txBuff[0u] = 0xC0u;
    txBuff[1u] = 0x14u;     /* instruction code (0x14 for ECHO) */
    txBuff[2u] = increment; /* increment value - P1 */
    txBuff[3u] = 0u;        /* P2 */
    txBuff[4u] = length;    /* P3 = Lc */

    for (i = 0u; i < length; i++)
    {
        txBuff[i + 5u] = i;
    }

    /* last byte is the data length again */
    txBuff[length + 5u] = length;
    /******************* Setup for T=1 transfer *******************/
    smartcard_setup_t1(coreParams);

    talResp.resp = rxBuff;
    talCmd.apdu = txBuff;
    talCmd.length = (4u + 1u + txBuff[4u] + 1u);
    talResp.length = 0u;
    smartcard_tal_send_cmd(coreParams, &talCmd, &talResp);

    /* payload length */
    if (talResp.length != length)
    {
        PRINTF("Received length not match!\r\n");
        return false;
    }

    for (i = 0u; i < length; i++)
    {
        if ((txBuff[i + 5u] + increment) != rxBuff[i])
        {
            PRINTF("Echo test Failed.\r\n");
            return false;
        }
    }
    PRINTF("Echo data matched!\r\n");

    return (kSCCoreSuccess == smartcard_tc_check_testresult(coreParams));
}

/*!
 * @brief This test will use EMV Level 1 APIs from emvlib and do protocol tests for T=0 using a
 * smartcard credit cards.
 */
void smartcard_emvl1_test(uint32_t param)
{
    uint8_t atrBuff[EMVL1_ATR_BUFF_SIZE];
    uint32_t atrLength = 0u;
    smartcard_core_params_t coreParams;
    smartcard_context_t context = {0};
    g_smartcardContext = &context;
    bool testT0done = false;
    bool testT1done = false;
    bool testPassed = false;

    memset(&coreParams, 0u, sizeof(smartcard_core_params_t));
    memset(&context, 0u, sizeof(smartcard_context_t));
    /* initialize EMV Level 1 core library */
    coreParams.x_context = &context;
    /* Initialize smartcard interrupts */
    smartcard_interrupts_config();
    /* Install time delay defined in application to smartcard driver. */
    installTimeDelay(&context);
    /* Fill-in smartcard config structure with init data */
    smartcard_init_user_config(&context);
    /* Print welcome string */
    PRINTF("........................... EMVL1 demo ..............................\r\n");
    /* Initialize the smartcard module with base address and configuration structure */
    SMARTCARD_INIT(base, &context, CLOCK_GetFreq(BOARD_SMARTCARD_CLOCK_MODULE_SOURCE_CLK));
    SMARTCARD_PHY_INIT(base, &context.interfaceConfig, CLOCK_GetFreq(BOARD_SMARTCARD_CLOCK_MODULE_SOURCE_CLK));
    /* Install test/application callback function */
    context.interfaceCallback = smartcard_interface_callback_function;
    /* Wait for a card inserted */
    wait_for_card_presence(&context);
    PRINTF("Card inserted.\r\n");
    /* Deactivate the card */
    PRINTF("Deactivating card...");
    SMARTCARD_PHY_DEACTIVATE(&context);
    PRINTF("Done!\r\n");

    do
    {
        /* Invalidate ATR buffer first */
        memset(atrBuff, 0, EMVL1_ATR_BUFF_SIZE);
        /* Deactivate the card */
        PRINTF("Resetting/Activating card...");
        /* get ATR */
        atrLength = 0u;
        if (smartcard_reset_handle_atr(&coreParams, atrBuff, kSMARTCARD_ColdReset, kSMARTCARD_NoWarmReset,
                                       &atrLength) == kSCCoreFail)
        {
            PRINTF("Invalid ATR received!\r\n");
            break;
        }
        PRINTF("Done!\r\n");
        if (context.cardParams.t0Indicated && !testT0done)
        { /* Invoke T=0 protocol specific test */
            testPassed = smartcard_emvl1_t0_test(&coreParams);
            testT0done = true;
            if (!testPassed)
            {
                PRINTF("Unsupported card inserted.\r\n");
                PRINTF("Received status bytes: 0x%.2X, 0x%.2X \r\n", context.statusBytes[0u], context.statusBytes[1u]);
            }
        }
        else if (context.cardParams.t1Indicated && !testT1done)
        { /* Invoke T=1 protocol specific test */
            testPassed = smartcard_emvl1_t1_test(&coreParams);
            testT1done = true;
        }
        /* Deactivate the card */
        PRINTF("Deactivating card...");
        SMARTCARD_PHY_DEACTIVATE(coreParams.x_context);
        PRINTF("Done!\r\n");
        if (testT0done && (testT1done || !context.cardParams.t1Indicated))
        {
            break;
        }
    } while (1);
    /* De-initialize smartcard driver */
    SMARTCARD_PHY_DEINIT(base, &context.interfaceConfig);
    SMARTCARD_DEINIT(base);

    PRINTF("***** EMVL1 Demo End *****\r\n\r\n");
}

int main(void)
{
    /* Initialize board hardware */
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
    /* Un-gate RTC for EMVSIM functionality */
    CLOCK_EnableClock(kCLOCK_Rtc0);
    /* Enable 32.768 kHz oscillator */
    RTC->CR |= RTC_CR_OSCE_MASK;
    /* Enable clock for INTMUX0 */
    CLOCK_EnableClock(kCLOCK_Intmux0);
    /* Run emvl1 functionality check */
    smartcard_emvl1_test(0u);

    while (1)
    {
    }
}
